using System;
using System.Collections.Generic;
using System.Text;
using System.Data;
using System.Data.OleDb;

namespace Стамотология.Classes
{
    //инкапсулирует запрос на вставку договора
    class InsertДоговор:ICommand
    {
        Договор договор;
        public InsertДоговор(string номерДоговора, int id_льготнаяКатегория, int id_поликлинника, int id_льготник, int id_комитет)
        {
            договор = new Договор();
            договор.НомерДоговора = номерДоговора;
            //договор.ДатаДоговора = датаДоговора;
            договор.id_льготнаяКатегория = id_льготнаяКатегория;
            договор.id_поликлинника = id_поликлинника;
            договор.id_комитет = id_комитет;
            //установим поле в false т.е. договор  существует но не вступил в силу
            договор.ФлагНаличияДоговора = false;
            договор.id_льготник = id_льготник;
        }

        public InsertДоговор(string номерДоговора,DateTime датаДоговора ,int id_льготнаяКатегория, int id_поликлинника,bool flag ,int id_льготник, int id_комитет)
        {
            договор = new Договор();
            договор.НомерДоговора = номерДоговора;

            договор.ДатаДоговора = датаДоговора;
            договор.id_льготнаяКатегория = id_льготнаяКатегория;

            договор.id_поликлинника = id_поликлинника;
            договор.id_комитет = id_комитет;

            договор.ФлагНаличияДоговора = flag;
            договор.id_льготник = id_льготник;
        }


    


        public void Execute()
        {
            string query = "INSERT INTO Договор (НомерДоговора,[id_льготнаяКатегория],id_поликлинника,id_комитет,[ФлагНаличияДоговора],id_льготник)" +
                            "values('"+договор.НомерДоговора +"'," + договор.id_льготнаяКатегория + "," + договор.id_поликлинника + "," + договор.id_комитет + "," + договор.ФлагНаличияДоговора + "," + договор.id_льготник + " )";

            //применим частный случай паттерна фасад
            string connectionString = ConnectionDB.ConnectionString();
            Query.Execute(query, connectionString);
        }

        
    }
}
